---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralW
source: html/9997ccca-9cd3-c2fa-294d-7eadd88f8133.htm
---
# StructuralSectionGeneralW Properties

Common set of parameters for structural analysis.